# CategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..CategoryId Property
ColorFillScheme Class See Also
---
Represents the element category that can be colored by this scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId CategoryId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CategoryId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
```

# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace